* HelloMedicare :project:
** WAITING Add E2E Tests for browse -> compare -> enroll flow 
- State "WAITING"    from "IN-PROGRESS" [2024-11-21 Thu 11:05]
:LOGBOOK:
CLOCK: [2024-11-14 Thu 10:34]--[2024-11-14 Thu 10:59] =>  0:25
CLOCK: [2024-11-14 Thu 10:02]--[2024-11-14 Thu 10:15] =>  0:13
CLOCK: [2024-11-14 Thu 09:35]--[2024-11-14 Thu 10:02] =>  0:27
:END:
- State "IN-PROGRESS" from "TODO"       [2024-11-14 Thu 09:35]
** TODO Add new header updates 
* Woven :project:
** DONE Add higlighting functionality 
- State "DONE"       from "TODO"       [2024-09-17 Tue 17:39]
** TODO redirect image clicks ie clicking an image in infobox 
** TODO sources ie sup[class="reference"] are currently hidden. make them popovers.
** TODO fix the issue with highlight scroll on page load 
** Fun learning software based on Wikipedia
*** https://www.reddit.com/r/DoesAnybodyElse/comments/rphcpq/dae_read_a_bunch_of_wikipedia_articles_for_fun/ 
